//https://metanit.com/c/tutorial/7.4.php?ysclid=m8toj4g5dz538518143 - пригодилось для работы ( прочитать файл, скопировать файл)

#include <stdio.h>
#include <stdlib.h>

/* Создать текстовый файл с записями следующего вида:
Иванов Петр Сергеевич 1975
Сидоров Николай Андреевич 1981
…
Воробьянинов Ипполит Матвеевич 1978

Прочитать данные из этого файла
записать в другой только те строки, которые относятся к родившимся позднее 1980 года. */


/*char buffer[256]; - объявление буфера размером 256 символов
FILE*fp=fopen(filename,"r"); - открытие файла в режиме чтения*/






